SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Application/Application/mm32g0020_it.c
/***********************************************************************************************************************
    @file    mm32g0020_it.c
    @author  FAE Team
    @date    30-Nov-2023
    @brief   THIS FILE PROVIDES ALL THE SYSTEM FUNCTIONS.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion */
#define _MM32G0020_IT_C_

/* Files include */
#include "platform.h"
#include "uart_receiveridleframe_interrupt.h"
#include "mm32g0020_it.h"

/**
  * @addtogroup MM32G0020_LibSamples
  * @{
  */

/**
  * @addtogroup UART
  * @{
  */

/**
  * @addtogroup UART_ReceiverIdleFrame_Interrupt
  * @{
  */

/* Private typedef ****************************************************************************************************/

/* Private define *****************************************************************************************************/

/* Private macro ******************************************************************************************************/

/* Private variables **************************************************************************************************/

/* Private functions **************************************************************************************************/

/***********************************************************************************************************************
  * @brief  This function handles Non maskable interrupt
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void NMI_Handler(void)
{
    while (1)
    {
    }
}

/***********************************************************************************************************************
  * @brief  This function handles Hard fault interrupt
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void HardFault_Handler(void)
{
    while (1)
    {
    }
}

/***********************************************************************************************************************
  * @brief  This function handles Memory management fault
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void MemManage_Handler(void)
{
    while (1)
    {
    }
}

/***********************************************************************************************************************
  * @brief  This function handles Pre-fetch fault, memory access fault
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void BusFault_Handler(void)
{
    while (1)
    {
    }
}

/***********************************************************************************************************************
  * @brief  This function handles Undefined instruction or illegal state
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void UsageFault_Handler(void)
{
    while (1)
    {
    }
}

/***********************************************************************************************************************
  * @brief  This function handles System service call via SWI instruction
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void SVCall_Handler(void)
{
}

/***********************************************************************************************************************
  * @brief  This function handles Debug monitor
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void DebugMon_Handler(void)
{
}

/***********************************************************************************************************************
  * @brief  This function handles Pendable request for system service
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void PendSV_Handler(void)
{
}

/***********************************************************************************************************************
  * @brief  This function handles System tick timer
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void SysTick_Handler(void)
{
    if (0 != PLATFORM_DelayTick)
    {
        PLATFORM_DelayTick--;
    }
}

/***********************************************************************************************************************
  * @brief  This function handles UART2 Handler
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void UART2_IRQHandler(void)
{
    uint8_t i = 0;

    if (SET == UART_GetITStatus(UART2, UART_IT_RX))
    {
        UART_RxBuffer[UART_RxLength++] = UART_ReceiveData(UART2);

        UART_ClearITPendingBit(UART2, UART_IT_RX);
    }

    if (SET == UART_GetITStatus(UART2, UART_IT_RXIDLE))
    {
        UART_ClearITPendingBit(UART2, UART_IT_RXIDLE);

        for (i = 0; i < UART_RxLength; i++)
        {
            UART_SendData(UART2, UART_RxBuffer[i]);

            while (RESET == UART_GetFlagStatus(UART2, UART_FLAG_TXC))
            {
            }
        }

        UART_RxLength = 0;
    }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/********************************************** (C) Copyright MindMotion **********************************************/

